In [2]:
import pandas as pd

In [9]:
data_series = pd.Series(['UNC', 'Duke', 'NC State'])

In [10]:
data_series

0         UNC
1        Duke
2    NC State
dtype: object

In [8]:
data_series[1]

'Duke'

In [24]:
college_dicts =[
    {
        'name': 'UNC',
        'students': 10000,
        "is_state_school": True
    },
    {
        'name': 'Duke',
        'students': 5000,
        "is_state_school": False

    },
    {
        'name': 'NC State',
        'students': 20000,
        "is_state_school": True
    },
        {
        'name': 'Meredith',
        'students': 1000,
        "is_state_school": False
    },
    {
        'name': 'Peace',
        'students': 2000,
        "is_state_school": False
    },
    {
        'name': 'UNC Charlotte',
        'students': 20000,
        "is_state_school":True
    },
]

college_dicts

[{'name': 'UNC', 'students': 10000, 'is_state_school': True},
 {'name': 'Duke', 'students': 5000, 'is_state_school': False},
 {'name': 'NC State', 'students': 20000, 'is_state_school': True},
 {'name': 'Meredith', 'students': 1000, 'is_state_school': False},
 {'name': 'Peace', 'students': 2000, 'is_state_school': False},
 {'name': 'UNC Charlotte', 'students': 20000, 'is_state_school': True}]

In [25]:
colleges_df = pd.DataFrame(college_dicts)

In [15]:
colleges_df

       name  students
0       UNC     10000
1      Duke      5000
2  NC State     20000

In [16]:
college_lists = {
    'name': ['UNC', 'Duke', 'NC State'],
    'students': [10000, 5000, 2000]
}

In [17]:
college_lists

{'name': ['UNC', 'Duke', 'NC State'], 'students': [10000, 5000, 2000]}

In [19]:
colleges_df = pd.DataFrame(college_lists)

In [20]:
colleges_df

       name  students
0       UNC     10000
1      Duke      5000
2  NC State      2000

In [21]:
colleges_df.head()

       name  students
0       UNC     10000
1      Duke      5000
2  NC State      2000

In [26]:
colleges_df.head()

       name  students  is_state_school
0       UNC     10000             True
1      Duke      5000            False
2  NC State     20000             True
3  Meredith      1000            False
4     Peace      2000            False

In [27]:
colleges_df.describe()

           students
count      6.000000
mean    9666.666667
std     8594.571930
min     1000.000000
25%     2750.000000
50%     7500.000000
75%    17500.000000
max    20000.000000

In [28]:
colleges_df['name']

0              UNC
1             Duke
2         NC State
3         Meredith
4            Peace
5    UNC Charlotte
Name: name, dtype: object

In [29]:
colleges_df[['name', 'is_state_school']]

            name  is_state_school
0            UNC             True
1           Duke            False
2       NC State             True
3       Meredith            False
4          Peace            False
5  UNC Charlotte             True

In [30]:
colleges_df['students'].mean()

9666.666666666666

In [31]:
colleges_df['students'].sum()

58000

In [36]:
college_names = colleges_df['name'].unique()

In [37]:
for name in college_names:
    print(name)

UNC
Duke
NC State
Meredith
Peace
UNC Charlotte

In [38]:
colleges_df

            name  students  is_state_school
0            UNC     10000             True
1           Duke      5000            False
2       NC State     20000             True
3       Meredith      1000            False
4          Peace      2000            False
5  UNC Charlotte     20000             True

In [39]:
students_in_thousands = colleges_df['students'] / 1000
students_in_thousands

0    10.0
1     5.0
2    20.0
3     1.0
4     2.0
5    20.0
Name: students, dtype: float64

In [40]:
colleges_df['students in thousands'] = students_in_thousands

In [52]:
colleges_df

            name  students  is_state_school
0            UNC     10000             True
1           Duke      5000            False
2       NC State     20000             True
3       Meredith      1000            False
4          Peace      2000            False
5  UNC Charlotte     20000             True

In [51]:
colleges_df.drop(columns=['students in thousands'], inplace=True)